evan-dp/NordicProjects/SDKs/nRF5_SDK_for_Thread_v0.8.0_fc4eda1/examples/dfu/dfu_req_handling/dfu_req_handling.c
            case DFU_FW_TYPE_SOFTDEVICE:
                // not loaded
                break;

            case DFU_FW_TYPE_BOOTLOADER: // fall through
            case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
                if (p_init->has_fw_version == false)
                {
                    return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
                }
                fw_version = s_dfu_settings.bootloader_version;
                break;

            default:
                NRF_LOG_INFO("Unknown FW update type\r\n");
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
        }

        NRF_LOG_INFO("Req version: %d, Expected: %d\r\n", p_init->fw_version, fw_version);

        // Check of init command FW version
        switch (p_init->type)
        {
            case DFU_FW_TYPE_APPLICATION:
                if (p_init->fw_version < fw_version)
                {
                    NRF_LOG_ERROR("FW version too low\r\n");
                    return ext_error_set(NRF_DFU_EXT_ERROR_FW_VERSION_FAILURE);
                }
                break;

            case DFU_FW_TYPE_BOOTLOADER:            // fall through
            case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
                // updating the bootloader is stricter. There must be an increase in version number
                if (p_init->fw_version <= fw_version)
                {
                    NRF_LOG_ERROR("BL FW version too low\r\n");
                    return ext_error_set(NRF_DFU_EXT_ERROR_FW_VERSION_FAILURE);
                }
                break;

            default:
                // do not care about fw_version in the case of a softdevice transfer
                break;
        }

#ifdef NRF_DFU_DEBUG_VERSION
    }
#endif

    // Check the signature
    switch (p_command->signature_type)
    {
        case DFU_SIGNATURE_TYPE_ECDSA_P256_SHA256:
            {
                #if 0
                NRF_LOG_INFO("Init command:\r\n");
                NRF_LOG_HEXDUMP_INFO(&s_dfu_settings.init_command[0], s_dfu_settings.progress.command_size);
                NRF_LOG_INFO("\r\n");

                NRF_LOG_INFO("Init command (raw data to be hashed):\r\n");
                NRF_LOG_HEXDUMP_INFO(&p_init_cmd[0], init_cmd_len);
                NRF_LOG_INFO("\r\n");
                #endif


                NRF_LOG_INFO("Calculating init packet hash\r\n");
                err_code = nrf_crypto_hash_compute(hash_info_sha256, p_init_cmd, init_cmd_len, &init_packet_hash);
                if (err_code != NRF_SUCCESS)
                {
                    return NRF_DFU_RES_CODE_OPERATION_FAILED;
                }

                if (crypto_sig.length != p_command->signature.size)
                {
                    return NRF_DFU_RES_CODE_OPERATION_FAILED;
                }

                // Prepare the signature received over the air.
                memcpy(crypto_sig.p_value, p_command->signature.bytes, p_command->signature.size);

                #if 0
                NRF_LOG_INFO("Signature\r\n");
                NRF_LOG_HEXDUMP_INFO(&p_command->signature.bytes[0], p_command->signature.size);
                NRF_LOG_INFO("\r\n");
                #endif

                //NRF_LOG_INFO("signature len: %d\r\n", p_command->signature.size);

                // calculate the signature
                NRF_LOG_INFO("Verify signature\r\n");
                err_code = nrf_crypto_ecdsa_verify_hash(sig_info_p256, &crypto_key_pk, &init_packet_hash, &crypto_sig);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Signature failed\r\n");
                    return NRF_DFU_RES_CODE_INVALID_OBJECT;
                }

                NRF_LOG_INFO("Image verified\r\n");
            }
            break;

        default:
            NRF_LOG_INFO("Invalid signature type\r\n");
            return ext_error_set(NRF_DFU_EXT_ERROR_WRONG_SIGNATURE_TYPE);
    }

    // Get the update size
    m_firmware_size_req = 0;

    switch (p_init->type)
    {
        case DFU_FW_TYPE_APPLICATION:
            if (p_init->has_app_size == false)
            {
                NRF_LOG_ERROR("No app image size\r\n");
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->app_size;
            break;

        case DFU_FW_TYPE_BOOTLOADER:
            if (p_init->has_bl_size == false)
            {
                NRF_LOG_ERROR("No bl image size\r\n");
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->bl_size;
            // check that the size of the bootloader is not larger than the present one.
#if defined ( NRF51 )
            if (p_init->bl_size > BOOTLOADER_SETTINGS_ADDRESS - BOOTLOADER_START_ADDR)
#elif defined( NRF52_SERIES )
            if (p_init->bl_size > NRF_MBR_PARAMS_PAGE_ADDRESS - BOOTLOADER_START_ADDR)
#endif
            {
                NRF_LOG_ERROR("BL too large\r\n");
                return NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
            }
            break;

        case DFU_FW_TYPE_SOFTDEVICE:
            if (p_init->has_sd_size == false)
            {
                NRF_LOG_ERROR("No SD image size\r\n");
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->sd_size;
            break;

        case DFU_FW_TYPE_SOFTDEVICE_BOOTLOADER:
            if (p_init->has_bl_size == false || p_init->has_sd_size == false)
            {
                NRF_LOG_ERROR("NO BL/SD size\r\n");
                return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
            }
            m_firmware_size_req += p_init->sd_size + p_init->bl_size;
            if (p_init->sd_size == 0 || p_init->bl_size == 0)
            {
                NRF_LOG_ERROR("BL+SD size 0\r\n");
                return NRF_DFU_RES_CODE_INVALID_PARAMETER;
            }

            // check that the size of the bootloader is not larger than the present one.
#if defined ( NRF51 )
            if (p_init->bl_size > BOOTLOADER_SETTINGS_ADDRESS - BOOTLOADER_START_ADDR)
#elif defined ( NRF52_SERIES )
            if (p_init->bl_size > NRF_MBR_PARAMS_PAGE_ADDRESS - BOOTLOADER_START_ADDR)
#endif
            {
                NRF_LOG_ERROR("BL too large (SD+BL)\r\n");
                return NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
            }
            break;

        default:
            NRF_LOG_ERROR("Unknown FW update type\r\n");
            return ext_error_set(NRF_DFU_EXT_ERROR_INIT_COMMAND_INVALID);
    }

    NRF_LOG_INFO("Running hash check\r\n");
    // SHA256 is the only supported hash
    memcpy(fw_hash.p_value, &p_init->hash.hash.bytes[0], NRF_CRYPTO_HASH_SIZE_SHA256);

    // Instead of checking each type with has-check, check the result of the size_req to
    // Validate its content.
    if (m_firmware_size_req == 0)
    {
        NRF_LOG_ERROR("No FW size\r\n");
        return NRF_DFU_RES_CODE_INVALID_PARAMETER;
    }

